pedPos = {96.7939453125, -292.8369140625, 1.578125} -- координаты бота и поворот для устройства.

pedSkin = 123 -- BOT SKİN

gruzID = {2358,3046,2694 } -- ID того что носим. Будет спавнится рандомно

knopka = "E" -- кнопка открытия окна

boatID = 498 -- ид грузовика

spawnBoat = {           --- координаты и поворот спавна грузовиков


 {78.826171875,-274.1328125,1.6482720375061,0,0,220},
 {65.865234375,-271.994140625,1.6467533111572,0,0,270},
 {104.6796875,-289.6826171875,1.9,0,0,90},
 }

spawnSklad = { -- Координаты  спавна "склада". 
    {89.302734375, -310.8583984375, 1.578125},
}

money = 50 -- зарплата за один груз